In [1]:
import pandas as pd
import numpy as np
import matplotlib as mplb
import os

# Change Directory

In [2]:
os.chdir('/home/kishlay/Documents/Data Analytics Practice Problems/Titanic')

# Load the data and combine

In [3]:
df1 = pd.read_csv('train.csv')
df2 = pd.read_csv('test.csv')
df1['source'] = 'train'
df2['source'] = 'test'
df3 = pd.concat([df1,df2])

In [4]:
df3.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,source
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171,train
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599,train
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282,train
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803,train
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450,train


# Exploration of the data

In [5]:
#count the null values in each column
print("No of empty values in columns is:")
print(df3.apply(lambda x:sum(x.isnull())))

No of empty values in columns is:
Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived        418
Ticket            0
source            0
dtype: int64

In [6]:
#count the unique values in columns
print("No of unique values in columns is:")
print(df3.apply(lambda x: len(x.unique())))

No of unique values in columns is:
Age              99
Cabin           187
Embarked          4
Fare            282
Name           1307
Parch             8
PassengerId    1309
Pclass            3
Sex               2
SibSp             7
Survived          3
Ticket          929
source            2
dtype: int64

In [7]:
#filter categorical columns
categorical_columns = [x for x in df3.dtypes.index if df3.dtypes[x] == 'object']
categorical_columns = [x for x in categorical_columns if x not in ['Name','source','Ticket','Cabin']]
for col in categorical_columns:
    print('\nCount of values in Categorical column %s'%col)
    print(df3[col].value_counts())

Count of values in Categorical column Embarked
S    914
C    270
Q    123
Name: Embarked, dtype: int64

Count of values in Categorical column Sex
male      843
female    466
Name: Sex, dtype: int64

# Data Cleaning

In [8]:
#delete cabin as it is almost empty
del df3['Cabin']

In [9]:
#Fill empty fare data with mean price for its 'Pclass'
miss_data = df3['Fare'].isnull()
mean_fare = df3.pivot_table(index='Pclass',values='Fare')
print('\nMissing Fare data before:%d'%sum(miss_data))
df3.loc[miss_data,'Fare'] = mean_fare.loc[df3.loc[miss_data,'Pclass']].iloc[0].iloc[0]
print('Missing Fare data after:%d'%sum(df3['Fare'].isnull()))

Missing Fare data before:1
Missing Fare data after:0

In [10]:
#Fill Embarked with the mode of embarked
miss_data = df3['Embarked'].isnull()
print('\nMissing Embarked data before:%d'%sum(miss_data))
df3.loc[miss_data,'Embarked'] = df3['Embarked'].mode().iloc[0]
print('Missing Embarked data after:%d'%sum(df3['Embarked'].isnull()))

Missing Embarked data before:2
Missing Embarked data after:0

In [11]:
#Fill age with mean of same group [Sex,SibSp,Parch]
miss_data = df3['Age'].isnull()
print('\nMissing Age data before:%d'%sum(miss_data))
mean_group_age = df3.pivot_table(index=['Sex','SibSp','Parch'],values='Age')
df3.loc[miss_data,'Age'] = df3[miss_data].T.apply(lambda x:mean_group_age.loc[x['Sex'],x['SibSp'],x['Parch']]).T['Age']
print('Missing Age data after 1st attempt:%d'%sum(df3['Age'].isnull()))
miss_data = df3['Age'].isnull()
df3.loc[miss_data,'Age'] = np.mean(df3.Age)
print('Missing Age data after 2nd attempt:%d'%sum(df3['Age'].isnull()))

Missing Age data before:263
Missing Age data after 1st attempt:6
Missing Age data after 2nd attempt:0

# Feature Engineering

In [12]:
#Extracting titles from Names
A = df3['Name'].str.split('(.*, )|(\\..*)').tolist()
df3['Name'] = pd.Series([x[3] for x in A])
print("\nUnique Titles Before:\n",df3['Name'].value_counts())

Unique Titles Before:
 Mr              745
Miss            283
Mrs             183
Master           63
Dr               10
Rev               9
Col               2
Mlle              2
Mme               2
Major             2
Don               2
Sir               1
Ms                1
Capt              1
Lady              1
Jonkheer          1
the Countess      1
Name: Name, dtype: int64

In [13]:
# miss women
miss_women = df3['Name'].isin(['Ms','Mlle'])
df3.loc[miss_women,'Name'] = 'Miss'

In [14]:
# mrs women
df3.loc[df3['Name'] == 'Mme','Name'] = 'Mrs'

In [15]:
# officer
officers = df3['Name'].isin(['Capt', 'Col', 'Don', 'Dr', 'Major', 'Rev'])
df3.loc[officers,'Name'] = 'officer'

In [16]:
# royalty
royalty = df3['Name'].isin(['Dona', 'Lady', 'the Countess','Sir', 'Jonkheer'])
df3.loc[royalty,'Name'] = 'royalty'

In [17]:
print("\nUnique Titles After:\n",df3['Name'].value_counts())

Unique Titles After:
 Mr         745
Miss       286
Mrs        185
Master      63
officer     26
royalty      4
Name: Name, dtype: int64

In [18]:
# Set Family Size
df3['FamilySize'] = df3['Parch'] + df3['SibSp']
df3['FamilySize'].head(10)

0    1
1    1
2    0
3    1
4    0
5    0
6    0
7    4
8    2
9    1
Name: FamilySize, dtype: int64

In [19]:
# Set Child or not
df3['Child'] = df3['Age'].apply(lambda x: 0 if x > 12 else 1)
df3['Child'].head()

0    0
1    0
2    0
3    0
4    0
Name: Child, dtype: int64

In [20]:
# Drop transformed columns
df3.drop(['Age','Parch','SibSp'],axis=1,inplace=True)

In [21]:
df3.head()

,Embarked,Fare,Name,PassengerId,Pclass,Sex,Survived,Ticket,source,FamilySize,Child
0,S,7.2500,Mr,1,3,male,0.0,A/5 21171,train,1,0
1,C,71.2833,Mrs,2,1,female,1.0,PC 17599,train,1,0
2,S,7.9250,Miss,3,3,female,1.0,STON/O2. 3101282,train,0,0
3,S,53.1000,Mrs,4,1,female,1.0,113803,train,1,0
4,S,8.0500,Mr,5,3,male,0.0,373450,train,0,0

# Data Transformation

In [24]:
# Normalize the fares
df3['Fare'] = (df3['Fare'] - df3['Fare'].min())/(df3['Fare'].max() - df3['Fare'].min())
df3.head()

,Embarked,Fare,Name,PassengerId,Pclass,Sex,Survived,Ticket,source,FamilySize,Child
0,S,0.014151,Mr,1,3,male,0.0,A/5 21171,train,1,0
1,C,0.139136,Mrs,2,1,female,1.0,PC 17599,train,1,0
2,S,0.015469,Miss,3,3,female,1.0,STON/O2. 3101282,train,0,0
3,S,0.103644,Mrs,4,1,female,1.0,113803,train,1,0
4,S,0.015713,Mr,5,3,male,0.0,373450,train,0,0

In [27]:
#Transforming Categorical Variables
from sklearn.preprocessing import LabelEncoder
var_mod = ['Sex','Name']
le = LabelEncoder()
for i in var_mod:
    df3[i] = le.fit_transform(df3[i])

In [28]:
#One Hot Coding:
df3 = pd.get_dummies(df3, columns=['Sex','Embarked','Name'])
df3.drop(['Ticket'],axis=1,inplace=True)

In [29]:
# Seperate the data
train_processed = df3[df3['source'] == 'train']
test_processed = df3[df3['source'] == 'test']
train_processed.drop(['source'],axis=1,inplace=True)
test_processed.drop(['source','Survived'],axis=1,inplace=True)
# Store data as csv
train_processed.to_csv('train_p.csv',index=False)
test_processed.to_csv('test_p.csv',index=False)

/home/kishlay/.local/lib/python3.5/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.
/home/kishlay/.local/lib/python3.5/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """

In [30]:
pd.read_csv('train_p.csv').head()

,Fare,PassengerId,Pclass,Survived,FamilySize,Child,Sex_0,Sex_1,Embarked_C,Embarked_Q,Embarked_S,Name_0,Name_1,Name_2,Name_3,Name_4,Name_5
0,0.014151,1,3,0.0,1,0,0,1,0,0,1,0,0,1,0,0,0
1,0.139136,2,1,1.0,1,0,1,0,1,0,0,0,0,0,1,0,0
2,0.015469,3,3,1.0,0,0,1,0,0,0,1,0,1,0,0,0,0
3,0.103644,4,1,1.0,1,0,1,0,0,0,1,0,0,0,1,0,0
4,0.015713,5,3,0.0,0,0,0,1,0,0,1,0,0,1,0,0,0

In [31]:
pd.read_csv('test_p.csv').head()

,Fare,PassengerId,Pclass,FamilySize,Child,Sex_0,Sex_1,Embarked_C,Embarked_Q,Embarked_S,Name_0,Name_1,Name_2,Name_3,Name_4,Name_5
0,0.015282,892,3,0,0,0,1,0,1,0,0,0,1,0,0,0
1,0.013663,893,3,1,0,1,0,0,0,1,0,0,0,1,0,0
2,0.018909,894,2,0,0,0,1,0,1,0,0,1,0,0,0,0
3,0.016908,895,3,0,0,0,1,0,0,1,0,0,0,1,0,0
4,0.023984,896,3,2,0,1,0,0,0,1,0,0,1,0,0,0